In [15]:
%pip install openpyxl

Requirement already satisfied: openpyxl in /home/zeeshan/miniconda3/envs/ml_env/lib/python3.12/site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in /home/zeeshan/miniconda3/envs/ml_env/lib/python3.12/site-packages (from openpyxl) (1.1.0)

In [20]:
import pandas as pd
import seaborn as sns
# load data set 
kashti = sns.load_dataset("titanic")
# write a file 
kashti.to_excel("datasets/titanic.xlsx")

In [29]:
# how to read a file
import pandas as pd
df = pd.read_excel("datasets/titanic.xlsx")
df.info() # get info about data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   891 non-null    int64
 1   survived     891 non-null    int64
 2   pclass       891 non-null    int64
 3   sex          891 non-null    object
 4   age          714 non-null    float64
 5   sibsp        891 non-null    int64
 6   parch        891 non-null    int64
 7   fare         891 non-null    float64
 8   embarked     889 non-null    object
 9   class        891 non-null    object
 10  who          891 non-null    object
 11  adult_male   891 non-null    bool
 12  deck         203 non-null    object
 13  embark_town  889 non-null    object
 14  alive        891 non-null    object
 15  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(5), object(7)
memory usage: 99.3+ KB

In [31]:
df.head() # get top 5 records from data

,Unnamed: 0,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True